# Pandas
---
python으로 하는 excel   

## datatype
1. Series <- numpy 1차원 vector
2. DataFrame <- series 여러개가 column으로 이어서 만들어진 matrix <- numpy matrix

In [1]:
import numpy as np
import pandas as pd

### Series
---
* numpy array vector - index가 없다
* Series <= numpy array vector + index
* pd.Series()

In [5]:
L = [1,2,3,4]

s = pd.Series(L)
s

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
s = pd.Series(L, index = ['a','b','c','d'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
s['a']

1

In [10]:
s['c'] = 10
s

a     1
b     2
c    10
d     4
dtype: int64

In [12]:
s[['c','d']]     # 여러개의 요소를 indexing 할 때는 리스트형식으로!!

c    10
d     4
dtype: int64

In [14]:
s > 5            # broadcasting > element wise operating : [5,5,5,5]와 비교를 한다

a    False
b    False
c     True
d    False
dtype: bool

In [16]:
s[s > 5]         # boolean indexing

c    10
dtype: int64

In [17]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [20]:
'a' in s

True

In [22]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [23]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [25]:
s.index = ['가', '나', '다', '라']
s

가     1
나     2
다    10
라     4
dtype: int64

### DataFrame
---
* series가 column 단위로 붙어서 만들어진 matrix (series => dataframe)
* pd.DataFrame()

In [2]:
# np.nan == None

raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'amy'], 
            'last_name': ['miller', np.nan, 'ali','milner', 'coozer'],
            'age' : [42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'postestscore' : [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'amy'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'pretestscore': [4, nan, nan, 2, 4],
 'postestscore': [25, nan, nan, 62, 72]}

In [3]:
# key : columns
# value : columns 값

df = pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [4]:
df.head()    # 상위 5개

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [6]:
df.tail(2)    # 하위 2개

  first_name last_name   age  pretestscore  postestscore
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    4 non-null      object
 1   last_name     4 non-null      object
 2   age           4 non-null      float64
 3   pretestscore  3 non-null      float64
 4   postestscore  3 non-null      float64
dtypes: float64(3), object(2)
memory usage: 328.0+ bytes

#### 데이터를 가공할 때
column - 특징을 칼럼으로 잡는다. ex) 학생 학년, 이름, 주소, 성적   
row - 개별 데이터 ex) 첫번째 학생, 두번째 학생   

- colimnm - feature(열)
- row - data(행)

하나의 칼럼 - 하나의 series

dataFrame - series가 연결된 matrix   


##### 하나의 칼럼은 동일한 타입의 데이터로 구성된다
##### 칼럼 간에는 다른 데이터 타입의 칼럼들이 존재한다

In [47]:
# column indexing => df[col_name]
df['first_name']

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [37]:
df[['last_name','age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    milner  24.0
4    coozer  73.0

In [41]:
df[3:]

  first_name last_name   age  pretestscore  postestscore
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

df.first_name

##### 속성으로 칼럼에 접근하는 방식
1. 칼럼이름에 space가 있으면 안된다
2. 칼럼을 수정할 때 주의가 필요

In [11]:
df['age'].apply(lambda x : x * 10)      # 익명함수 - 임시함수

0    420.0
1      NaN
2    360.0
3    240.0
4    730.0
Name: age, dtype: float64

In [10]:
def tempf(x):
    return x * 10

df['age'].apply(tempf)

0    420.0
1      NaN
2    360.0
3    240.0
4    730.0
Name: age, dtype: float64

In [48]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [49]:
df.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'postestscore'], dtype='object')

In [50]:
df.values

array([['jason', 'miller', 42.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 36.0, nan, nan],
       ['jake', 'milner', 24.0, 2.0, 62.0],
       ['amy', 'coozer', 73.0, 4.0, 72.0]], dtype=object)

In [84]:
# row indexing

# loc[], iloc[] - row만 선택 or row와 column을 동시에 선택
# df.loc[index name]
# df.iloc[index order num]

# df.loc[row name, col name]
# df.iloc[row index, col index]

In [53]:
df.index = ['a','b','c','d','e']
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [57]:
df.loc['d']     # .loc[index의 이름]

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [59]:
df.iloc[3]     # .iloc[순번]

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [60]:
df.iloc[3:]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [61]:
df.loc['d':]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [62]:
df.loc[['c','e']]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [63]:
df.iloc[[2,4]]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [64]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [67]:
df.loc['c', 'last_name']       # 'c'열의 'last_name'

'ali'

In [68]:
df.iloc[2, 1]       # 2열의 1번

'ali'

In [70]:
df.loc[['c','d'],'first_name' : 'age']

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [74]:
df.iloc[[2,3], :3]

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [75]:
df.loc['d','pretestscore'] = 100.0
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [77]:
df.loc[['c','e'], ['age','postestscore']]

    age  postestscore
c  36.0           NaN
e  73.0          72.0

In [78]:
df.iloc[[2,4],[2,4]]

    age  postestscore
c  36.0           NaN
e  73.0          72.0

In [79]:
df.loc['d':, 'pretestscore':]

   pretestscore  postestscore
d         100.0          62.0
e           4.0          72.0

In [80]:
df.iloc[3:,3:]

   pretestscore  postestscore
d         100.0          62.0
e           4.0          72.0

In [83]:
df.iloc[1:len(df):2]

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
d       jake    milner  24.0         100.0          62.0

In [85]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

dataframe에 boolean indexing도 가능하다 => row indexing

In [86]:
df.loc[df['age'] >= 40]

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
e        amy    coozer  73.0           4.0          72.0

In [87]:
# 'last_name'이 'ali'인 사람의 데이터를 출력

In [88]:
df.loc[df['last_name'] == 'ali']

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN

In [93]:
# 나이가 40이상인 사람의 postestscore 평균 점수는 얼마인가?

In [99]:
np.mean(df.loc[df['age'] >= 40, 'postestscore'])

48.5

In [101]:
df.loc[df['age'] >= 40]['postestscore'].mean()

48.5

> 새로운 칼럼 추가

In [140]:
df['address'] = ['seoul', 'incheon', 'daejeon', 'pusan', 'gwangju']

In [107]:
df

  first_name last_name   age  pretestscore  postestscore  address
a      jason    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN  incheon
c       tina       ali  36.0           NaN           NaN  daejeon
d       jake    milner  24.0         100.0          62.0    pusan
e        amy    coozer  73.0           4.0          72.0  gwangju

In [141]:
# 칼럼 이름 바꾸기
df.columns = ['fn', 'ln', 'age', 'pres', 'posrs', 'add']
df

      fn      ln   age  pres  posrs      add
0  jason  miller  42.0   4.0   25.0    seoul
1    NaN     NaN   NaN   NaN    NaN  incheon
2   tina     ali  36.0   NaN    NaN  daejeon
3   jake  milner  24.0   2.0   62.0    pusan
4    amy  coozer  73.0   4.0   72.0  gwangju

In [142]:
# 특정 칼럼이름만 바꾸기

# df.rename(columns = {'add' : 'address'})    # 새로운 dataframe를 리턴 : 원본은 바뀌지 않는다


# df = df.rename(columns = {'add' : 'address'})          # 변수에 덮어쓰기를 해도되고
df.rename(columns = {'add' : 'address'}, inplace=True)    # inplace를 사용해도 된다
df

      fn      ln   age  pres  posrs  address
0  jason  miller  42.0   4.0   25.0    seoul
1    NaN     NaN   NaN   NaN    NaN  incheon
2   tina     ali  36.0   NaN    NaN  daejeon
3   jake  milner  24.0   2.0   62.0    pusan
4    amy  coozer  73.0   4.0   72.0  gwangju

> column 또는 row를 삭제

In [145]:
df.drop('address', axis=1, inplace = True) # drop에서는 axis 0 : 가로
df

      fn      ln   age  pres  posrs
0  jason  miller  42.0   4.0   25.0
1    NaN     NaN   NaN   NaN    NaN
2   tina     ali  36.0   NaN    NaN
3   jake  milner  24.0   2.0   62.0
4    amy  coozer  73.0   4.0   72.0

In [147]:
df.index = ['a','b','c','d','e']
df.drop('c', axis = 0)                # drop의 axis default값은 0이다

      fn      ln   age  pres  posrs
a  jason  miller  42.0   4.0   25.0
b    NaN     NaN   NaN   NaN    NaN
d   jake  milner  24.0   2.0   62.0
e    amy  coozer  73.0   4.0   72.0

In [148]:
# 여러개를 지울 때는 리스트로 묶는다
df.drop(['ln','pres'], axis = 1)   # drop에서는 axis 1 : 세로

      fn   age  posrs
a  jason  42.0   25.0
b    NaN   NaN    NaN
c   tina  36.0    NaN
d   jake  24.0   62.0
e    amy  73.0   72.0

In [170]:
# np.nan == None

raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'amy'], 
            'last_name': ['miller', np.nan, 'ali','milner', 'coozer'],
            'age' : [42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'postestscore' : [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'amy'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'pretestscore': [4, nan, nan, 2, 4],
 'postestscore': [25, nan, nan, 62, 72]}

In [171]:
df = pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [152]:
df.index = ['a','b','c','d','e']
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [160]:
df.loc[df['age'] >= 40]

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
e        amy    coozer  73.0           4.0          72.0

In [163]:
df.loc['a']

first_name       jason
last_name       miller
age               42.0
pretestscore       4.0
postestscore      25.0
Name: a, dtype: object

In [167]:
df.drop(['a'])

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0